In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
# update line below with your path to the turnstile data file
data = pd.read_csv('/Users/alexandrasmith/ds/metis/proj1_benson/Turnstile_Usage_Data__2017.csv')

# strip potential spaces
data.columns = data.columns.str.strip()

In [3]:
# add datetime column and change it to datetime time
data['Formatted_Datetime'] = pd.to_datetime(data['Date'] + ' ' + data['Time'], format = '%m/%d/%Y %H:%M:%S')

In [4]:
# view new column
data.head()

,C/A,Unit,SCP,Station,Line Name,Division,Date,Time,Description,Entries,Exits,Formatted_Datetime
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,12/31/2016,03:00:00,REGULAR,5991546,2028378,2016-12-31 03:00:00
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,12/31/2016,07:00:00,REGULAR,5991565,2028389,2016-12-31 07:00:00
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,12/31/2016,11:00:00,REGULAR,5991644,2028441,2016-12-31 11:00:00
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,12/31/2016,15:00:00,REGULAR,5991971,2028502,2016-12-31 15:00:00
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,12/31/2016,19:00:00,REGULAR,5992418,2028543,2016-12-31 19:00:00

In [5]:
# check type of new column
data.Formatted_Datetime.dtypes == 'datetime64[ns]'

True

In [6]:
# create a new column get the day of the week
data['Day_of_week'] = data['Formatted_Datetime'].dt.dayofweek # 0 = Monday, 1 = Tuesday, 3 = Wedenesday, etc.
del data['Time'] #not needed anymore
del data['Date']

# add new columns 'date', 'year', 'month', 'day'  
data['Date'] = [d.date() for d in data['Formatted_Datetime']]
data['Year'] = [d.year for d in data['Date']]
data['Month'] = [d.month for d in data['Date']]
data['Day'] = [d.day for d in data['Date']]
data['Hour'] = data['Formatted_Datetime'].dt.hour

In [7]:
# view new columns
data.head(2)

,C/A,Unit,SCP,Station,Line Name,Division,Description,Entries,Exits,Formatted_Datetime,Day_of_week,Date,Year,Month,Day,Hour
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,REGULAR,5991546,2028378,2016-12-31 03:00:00,5,2016-12-31,2016,12,31,3
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,REGULAR,5991565,2028389,2016-12-31 07:00:00,5,2016-12-31,2016,12,31,7

In [8]:
# add new column 'season' 
def seasonFun(mon):
    month=int(mon)
    if month>=3 and month<=5:
        return 'Spring'
    elif month>=6 and month<=8:
        return 'Summer'
    elif month>=9 and month<=11:
        return 'Fall'
    else:
        return 'Winter'
    
data['Season']= [seasonFun(s) for s in data['Month']]

In [9]:
# view new column
data.head(2)

,C/A,Unit,SCP,Station,Line Name,Division,Description,Entries,Exits,Formatted_Datetime,Day_of_week,Date,Year,Month,Day,Hour,Season
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,REGULAR,5991546,2028378,2016-12-31 03:00:00,5,2016-12-31,2016,12,31,3,Winter
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,REGULAR,5991565,2028389,2016-12-31 07:00:00,5,2016-12-31,2016,12,31,7,Winter

In [10]:
# add new column time of day
def timeFun(time):
    
    if time>=5 and time<12:
        return('Morning')
    elif time>=12 and time<17:
        return('Afternoon')
    elif time>=17 and time<21:
        return('Evening')
    else:
        return('Night')
    
data['Time_of_day']= [timeFun(t) for t in data['Hour']]

In [11]:
# view new column
data.head(2)

,C/A,Unit,SCP,Station,Line Name,Division,Description,Entries,Exits,Formatted_Datetime,Day_of_week,Date,Year,Month,Day,Hour,Season,Time_of_day
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,REGULAR,5991546,2028378,2016-12-31 03:00:00,5,2016-12-31,2016,12,31,3,Winter,Night
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,REGULAR,5991565,2028389,2016-12-31 07:00:00,5,2016-12-31,2016,12,31,7,Winter,Morning

In [12]:
mask = ((data["C/A"] == "A002") & 
        (data["Unit"] == "R051") & 
        (data["SCP"] == "02-00-00") & 
        (data["Station"] == "59 ST"))
data[mask].head()

,C/A,Unit,SCP,Station,Line Name,Division,Description,Entries,Exits,Formatted_Datetime,Day_of_week,Date,Year,Month,Day,Hour,Season,Time_of_day
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,REGULAR,5991546,2028378,2016-12-31 03:00:00,5,2016-12-31,2016,12,31,3,Winter,Night
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,REGULAR,5991565,2028389,2016-12-31 07:00:00,5,2016-12-31,2016,12,31,7,Winter,Morning
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,REGULAR,5991644,2028441,2016-12-31 11:00:00,5,2016-12-31,2016,12,31,11,Winter,Morning
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,REGULAR,5991971,2028502,2016-12-31 15:00:00,5,2016-12-31,2016,12,31,15,Winter,Afternoon
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,REGULAR,5992418,2028543,2016-12-31 19:00:00,5,2016-12-31,2016,12,31,19,Winter,Evening

In [13]:
(data
 .groupby(["C/A", "Unit", "SCP", "Station", "Formatted_Datetime"])
 .Entries.count()
 .reset_index()
 .sort_values("Entries", ascending=False)).head(5)

           C/A  Unit       SCP         Station  Formatted_Datetime  Entries
3661412  N329A  R201  01-06-01  WOODHAVEN BLVD 2017-03-17 05:00:00        2
7672131   R408  R449  00-00-02        E 149 ST 2017-03-10 08:00:00        2
1025742   C023  R213  00-00-01    BAY RIDGE AV 2017-10-07 16:00:00        2
1025743   C023  R213  00-00-01    BAY RIDGE AV 2017-10-07 20:00:00        2
1025744   C023  R213  00-00-01    BAY RIDGE AV 2017-10-08 00:00:00        2

In [14]:
# on 10/7, we seem to have two entries for same time. let's take a look
mask = ((data["C/A"] == "C023") & 
(data["Unit"] == "R213") & 
(data["SCP"] == "00-00-01") & 
(data["Station"] == "BAY RIDGE AV") &
(data["Formatted_Datetime"].dt.date == pd.datetime(2017, 10, 7).date()))
data[mask].head()

,C/A,Unit,SCP,Station,Line Name,Division,Description,Entries,Exits,Formatted_Datetime,Day_of_week,Date,Year,Month,Day,Hour,Season,Time_of_day
6918204,C023,R213,00-00-01,BAY RIDGE AV,R,BMT,RECOVR AUD,7595913,4642114,2017-10-07 12:00:00,5,2017-10-07,2017,10,7,12,Fall,Afternoon
6918205,C023,R213,00-00-01,BAY RIDGE AV,R,BMT,REGULAR,7595915,4642117,2017-10-07 16:00:00,5,2017-10-07,2017,10,7,16,Fall,Afternoon
6918206,C023,R213,00-00-01,BAY RIDGE AV,R,BMT,RECOVR AUD,6656915,2625182,2017-10-07 16:00:00,5,2017-10-07,2017,10,7,16,Fall,Afternoon
6918207,C023,R213,00-00-01,BAY RIDGE AV,R,BMT,REGULAR,7595915,4642117,2017-10-07 20:00:00,5,2017-10-07,2017,10,7,20,Fall,Evening
6918208,C023,R213,00-00-01,BAY RIDGE AV,R,BMT,RECOVR AUD,6656915,2625182,2017-10-07 20:00:00,5,2017-10-07,2017,10,7,20,Fall,Evening

In [15]:
data.Description.value_counts()

REGULAR       8845081
RECOVR AUD      33122
Name: Description, dtype: int64

In [16]:
# get rid of the duplicate entries
data.sort_values(["C/A", "Unit", "SCP", "Station", "Formatted_Datetime"], inplace=True, ascending=False)
data.drop_duplicates(subset=["C/A", "Unit", "SCP", "Station", "Formatted_Datetime"], inplace=True)

In [17]:
# sanity check to verify that "C/A", "Unit", "SCP", "Station", "Formatted_Datetime" is unique
(data
 .groupby(["C/A", "Unit", "SCP", "Station", "Formatted_Datetime"])
 .Entries.count()
 .reset_index()
 .sort_values("Entries", ascending=False)).head(5)

          C/A  Unit       SCP         Station  Formatted_Datetime  Entries
0        A002  R051  02-00-00           59 ST 2016-12-31 03:00:00        1
5918737  R145  R032  00-06-02  TIMES SQ-42 ST 2017-02-15 03:00:00        1
5918751  R145  R032  00-06-02  TIMES SQ-42 ST 2017-02-17 11:00:00        1
5918750  R145  R032  00-06-02  TIMES SQ-42 ST 2017-02-17 07:00:00        1
5918749  R145  R032  00-06-02  TIMES SQ-42 ST 2017-02-17 03:00:00        1

In [18]:
# sanity check to verify the duplicate we looked at before is gone
data.iloc[6918205:6918207]

,C/A,Unit,SCP,Station,Line Name,Division,Description,Entries,Exits,Formatted_Datetime,Day_of_week,Date,Year,Month,Day,Hour,Season,Time_of_day
6938882,N023,R332,01-00-02,135 ST,BC,IND,REGULAR,861025,2623328,2017-10-13 09:00:00,4,2017-10-13,2017,10,13,9,Fall,Morning
6938881,N023,R332,01-00-02,135 ST,BC,IND,REGULAR,860926,2622981,2017-10-13 05:00:00,4,2017-10-13,2017,10,13,5,Fall,Morning

In [19]:
# create a df to look at daily data counts
daily_data = data.groupby(["C/A", "Unit", "SCP", "Station", "Date"]).Entries.first().reset_index()

In [20]:
daily_data.head()

    C/A  Unit       SCP Station        Date  Entries
0  A002  R051  02-00-00   59 ST  2016-12-31  5992638
1  A002  R051  02-00-00   59 ST  2017-01-01  5993515
2  A002  R051  02-00-00   59 ST  2017-01-02  5994466
3  A002  R051  02-00-00   59 ST  2017-01-03  5996220
4  A002  R051  02-00-00   59 ST  2017-01-04  5997865

In [21]:
daily_data[["Prev_Date", "Prev_Entries"]] = (daily_data
                                                       .groupby(["C/A", "Unit", "SCP", "Station"])["Date", "Entries"]
                                                       .transform(lambda grp: grp.shift(1)))

In [22]:
daily_data.head()

    C/A  Unit       SCP Station        Date  Entries   Prev_Date  Prev_Entries
0  A002  R051  02-00-00   59 ST  2016-12-31  5992638         NaN           NaN
1  A002  R051  02-00-00   59 ST  2017-01-01  5993515  2016-12-31     5992638.0
2  A002  R051  02-00-00   59 ST  2017-01-02  5994466  2017-01-01     5993515.0
3  A002  R051  02-00-00   59 ST  2017-01-03  5996220  2017-01-02     5994466.0
4  A002  R051  02-00-00   59 ST  2017-01-04  5997865  2017-01-03     5996220.0